"""
Модуль с сообщениями об ошибках для тестов.
"""

# Сообщения об ошибках
TARGET_MISMATCH = "Введенные координаты цели не совпадают с ожидаемыми.\nОжидалось: {expected}\nПолучено: {actual}"
POST_MISMATCH = "Введенные координаты КНП не совпадают с ожидаемыми.\nОжидалось: {expected}\nПолучено: {actual}"
MEASURE_MISMATCH = "Введенные измерения не совпадают с ожидаемыми.\nОжидалось: {expected}\nПолучено: {actual}"
RESULT_MISMATCH = "Результат расчета не совпадает с ожидаемым.\nОжидалось: {expected}\nПолучено: {actual}"
